apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_usbhost.c
#ifdef CONFIG_USBHOST_ASYNCH
#if LPC17_40_IOBUFFERS > 0
  /* Remember the allocated DMA buffer address so that it can be freed when
   * the transfer completes.
   */

  uint8_t *alloc;             /* Allocated buffer */
#endif

  /* Retain the callback information for the asynchronous transfer
   * completion.
   */

  usbhost_asynch_t callback;  /* Transfer complete callback */
  void *arg;                  /* Argument that accompanies the callback */
#endif
};

/* The OCHI expects the size of an endpoint descriptor to be 16 bytes.
 * However, the size allocated for an endpoint descriptor is 32 bytes in
 * lpc17_40_ohciram.h.  This extra 16-bytes is used by the OHCI host driver
 * in order to maintain additional endpoint-specific data.
 */

struct lpc17_40_ed_s
{
  /* Hardware specific fields */

  struct ohci_ed_s hw;        /* 0-15 */

  /* Software specific fields */

  uint8_t          xfrtype;   /* 16: Transfer type.  See SB_EP_ATTR_XFER_* in usb.h */
  uint8_t          interval;  /* 17: Periodic EP polling interval: 2, 4, 6, 16, or 32 */
  sem_t            wdhsem;    /* 18: Semaphore used to wait for Writeback
                               *     Done Head event */

  /* Unused bytes may follow, depending on the size of sem_t */

  /* Pointer to structure that manages asynchronous transfers on this pipe */

  struct lpc17_40_xfrinfo_s *xfrinfo;
};

/* The OCHI expects the size of an transfer descriptor to be 16 bytes.
 * However, the size allocated for an endpoint descriptor is 32 bytes in
 * lpc17_40_ohciram.h.  This extra 16-bytes is used by the OHCI host driver
 * in order to maintain additional endpoint-specific data.
 */

struct lpc17_40_gtd_s
{
  /* Hardware specific fields */

  struct ohci_gtd_s hw;

  /* Software specific fields */

  struct lpc17_40_ed_s *ed;      /* Pointer to parent ED */
  uint8_t           pad[12];
};

/* The following is used to manage lists of free EDs, TDs, and TD buffers */

struct lpc17_40_list_s
{
  struct lpc17_40_list_s *flink; /* Link to next buffer in the list */

  /* Variable length buffer data follows */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations ******************************************************/

#ifdef CONFIG_LPC17_40_USBHOST_REGDEBUG
static void lpc17_40_printreg(uint32_t addr, uint32_t val, bool iswrite);
static void lpc17_40_checkreg(uint32_t addr, uint32_t val, bool iswrite);
static uint32_t lpc17_40_getreg(uint32_t addr);
static void lpc17_40_putreg(uint32_t val, uint32_t addr);
#else
#  define lpc17_40_getreg(addr)     getreg32(addr)
#  define lpc17_40_putreg(val,addr) putreg32(val,addr)
#endif

/* Semaphores ***************************************************************/

/* Byte stream access helper functions **************************************/

static inline uint16_t lpc17_40_getle16(const uint8_t *val);
#if 0 /* Not used */
static void lpc17_40_putle16(uint8_t *dest, uint16_t val);
#endif

/* OHCI memory pool helper functions ****************************************/

static inline void lpc17_40_edfree(struct lpc17_40_ed_s *ed);
static  struct lpc17_40_gtd_s *lpc17_40_tdalloc(void);
static void lpc17_40_tdfree(struct lpc17_40_gtd_s *buffer);
static uint8_t *lpc17_40_tballoc(void);
static void lpc17_40_tbfree(uint8_t *buffer);
#if LPC17_40_IOBUFFERS > 0
static uint8_t *lpc17_40_allocio(void);
static void lpc17_40_freeio(uint8_t *buffer);
#endif
static struct lpc17_40_xfrinfo_s *lpc17_40_alloc_xfrinfo(void);
static void lpc17_40_free_xfrinfo(struct lpc17_40_xfrinfo_s *xfrinfo);

/* ED list helper functions *************************************************/

static inline int lpc17_40_addctrled(struct lpc17_40_usbhost_s *priv,
                                     struct lpc17_40_ed_s *ed);
static inline int lpc17_40_remctrled(struct lpc17_40_usbhost_s *priv,
                                     struct lpc17_40_ed_s *ed);

static inline int lpc17_40_addbulked(struct lpc17_40_usbhost_s *priv,
                                     struct lpc17_40_ed_s *ed);
static inline int lpc17_40_rembulked(struct lpc17_40_usbhost_s *priv,
                                     struct lpc17_40_ed_s *ed);

#if !defined(CONFIG_USBHOST_INT_DISABLE) || !defined(CONFIG_USBHOST_ISOC_DISABLE)
static unsigned int lpc17_40_getinterval(uint8_t interval);
static void lpc17_40_setinttab(uint32_t value, unsigned int interval,
                               unsigned int offset);
#endif

static inline int lpc17_40_addinted(struct lpc17_40_usbhost_s *priv,
                                    const struct usbhost_epdesc_s *epdesc,
                                    struct lpc17_40_ed_s *ed);
static inline int lpc17_40_reminted(struct lpc17_40_usbhost_s *priv,
                                    struct lpc17_40_ed_s *ed);

static inline int lpc17_40_addisoced(struct lpc17_40_usbhost_s *priv,
                                     const struct usbhost_epdesc_s *epdesc,
                                     struct lpc17_40_ed_s *ed);
static inline int lpc17_40_remisoced(struct lpc17_40_usbhost_s *priv,
                                     struct lpc17_40_ed_s *ed);

/* Descriptor helper functions **********************************************/

static int lpc17_40_enqueuetd(struct lpc17_40_usbhost_s *priv,
                              struct lpc17_40_ed_s *ed, uint32_t dirpid,
                              uint32_t toggle, volatile uint8_t *buffer,
                              size_t buflen);
static int lpc17_40_ctrltd(struct lpc17_40_usbhost_s *priv,
                           struct lpc17_40_ed_s *ed, uint32_t dirpid,
                           uint8_t *buffer, size_t buflen);

/* Interrupt handling *******************************************************/

static int lpc17_40_usbinterrupt(int irq, void *context, void *arg);

/* USB host controller operations *******************************************/

static int lpc17_40_wait(struct usbhost_connection_s *conn,
                         struct usbhost_hubport_s **hport);
static int lpc17_40_rh_enumerate(struct usbhost_connection_s *conn,
                                 struct usbhost_hubport_s *hport);
static int lpc17_40_enumerate(struct usbhost_connection_s *conn,
                              struct usbhost_hubport_s *hport);

static int lpc17_40_ep0configure(struct usbhost_driver_s *drvr,
                                 usbhost_ep_t ep0, uint8_t funcaddr,
                                 uint8_t speed, uint16_t maxpacketsize);
static int lpc17_40_epalloc(struct usbhost_driver_s *drvr,
                            const struct usbhost_epdesc_s *epdesc,
                            usbhost_ep_t *ep);
static int lpc17_40_epfree(struct usbhost_driver_s *drvr, usbhost_ep_t ep);
static int lpc17_40_alloc(struct usbhost_driver_s *drvr,
                          uint8_t **buffer, size_t *maxlen);
static int lpc17_40_free(struct usbhost_driver_s *drvr, uint8_t *buffer);
static int lpc17_40_ioalloc(struct usbhost_driver_s *drvr,
                            uint8_t **buffer, size_t buflen);
static int lpc17_40_iofree(struct usbhost_driver_s *drvr, uint8_t *buffer);
static int lpc17_40_ctrlin(struct usbhost_driver_s *drvr, usbhost_ep_t ep0,
                           const struct usb_ctrlreq_s *req,
                           uint8_t *buffer);
static int lpc17_40_ctrlout(struct usbhost_driver_s *drvr, usbhost_ep_t ep0,
                            const struct usb_ctrlreq_s *req,
                            const uint8_t *buffer);
static int lpc17_40_transfer_common(struct lpc17_40_usbhost_s *priv,
                                    struct lpc17_40_ed_s *ed,
                                    uint8_t *buffer, size_t buflen);
#if LPC17_40_IOBUFFERS > 0
static int lpc17_40_dma_alloc(struct lpc17_40_usbhost_s *priv,
                              struct lpc17_40_ed_s *ed, uint8_t *userbuffer,
                              size_t buflen, uint8_t **alloc);
static void lpc17_40_dma_free(struct lpc17_40_usbhost_s *priv,
                              struct lpc17_40_ed_s *ed, uint8_t *userbuffer,
                              size_t buflen, uint8_t *alloc);
#endif
static ssize_t lpc17_40_transfer(struct usbhost_driver_s *drvr,
                                 usbhost_ep_t ep, uint8_t *buffer,
                                 size_t buflen);
#ifdef CONFIG_USBHOST_ASYNCH
static void lpc17_40_asynch_completion(struct lpc17_40_usbhost_s *priv,
                                       struct lpc17_40_ed_s *ed);
static int lpc17_40_asynch(struct usbhost_driver_s *drvr,
                           usbhost_ep_t ep, uint8_t *buffer,
                           size_t buflen, usbhost_asynch_t callback,
                           void *arg);
#endif
static int lpc17_40_cancel(struct usbhost_driver_s *drvr,
                           usbhost_ep_t ep);
#ifdef CONFIG_USBHOST_HUB
static int lpc17_40_connect(struct usbhost_driver_s *drvr,
                            struct usbhost_hubport_s *hport,
                            bool connected);
#endif
static void lpc17_40_disconnect(struct usbhost_driver_s *drvr,
                                struct usbhost_hubport_s *hport);

/* Initialization ***********************************************************/

static inline void lpc17_40_ep0init(struct lpc17_40_usbhost_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* In this driver implementation, support is provided for only a single a
 * single USB device.  All status information can be simply retained in a
 * single global instance.
 */

