apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_usbhost.c
static void lpc17_40_tdfree(struct lpc17_40_gtd_s *td)
{
  struct lpc17_40_list_s *tdfree = (struct lpc17_40_list_s *)td;

  /* This should not happen but just to be safe, don't free the common, pre-
   * allocated tail TD.
   */

  if (tdfree != NULL && td != TDTAIL)
    {
      tdfree->flink = g_tdfree;
      g_tdfree      = tdfree;
    }
}

/****************************************************************************
 * Name: lpc17_40_tballoc
 *
 * Description:
 *   Allocate an request/descriptor transfer buffer from the free list
 *
 * Assumptions:
 *   - Never called from an interrupt handler.
 *   - Protection from re-entrance must be assured by the caller
 *
 ****************************************************************************/

static uint8_t *lpc17_40_tballoc(void)
{
  uint8_t *ret = (uint8_t *)g_tbfree;
  if (ret)
    {
      g_tbfree = ((struct lpc17_40_list_s *)ret)->flink;
    }

  return ret;
}

/****************************************************************************
 * Name: lpc17_40_tbfree
 *
 * Description:
 *   Return an request/descriptor transfer buffer to the free list
 *
 ****************************************************************************/

static void lpc17_40_tbfree(uint8_t *buffer)
{
  struct lpc17_40_list_s *tbfree = (struct lpc17_40_list_s *)buffer;

  if (tbfree)
    {
      tbfree->flink              = g_tbfree;
      g_tbfree                   = tbfree;
    }
}

/****************************************************************************
 * Name: lpc17_40_allocio
 *
 * Description:
 *   Allocate an IO buffer from the free list
 *
 * Assumptions:
 *   - Never called from an interrupt handler.
 *   - Protection from re-entrance must be assured by the caller
 *
 ****************************************************************************/

#if LPC17_40_IOBUFFERS > 0
static uint8_t *lpc17_40_allocio(void)
{
  uint8_t *ret;
  irqstate_t flags;

  /* lpc17_40_freeio() may be called from the interrupt level */

  flags = enter_critical_section();
  ret = (uint8_t *)g_iofree;
  if (ret)
    {
      g_iofree = ((struct lpc17_40_list_s *)ret)->flink;
    }

  leave_critical_section(flags);
  return ret;
}
#endif

/****************************************************************************
 * Name: lpc17_40_freeio
 *
 * Description:
 *   Return an TD buffer to the free list
 *
 ****************************************************************************/

#if LPC17_40_IOBUFFERS > 0
static void lpc17_40_freeio(uint8_t *buffer)
{
  struct lpc17_40_list_s *iofree;
  irqstate_t flags;

  /* Could be called from the interrupt level */

  flags         = enter_critical_section();
  iofree        = (struct lpc17_40_list_s *)buffer;
  iofree->flink = g_iofree;
  g_iofree      = iofree;
  leave_critical_section(flags);
}
#endif

/****************************************************************************
 * Name: lpc17_40_alloc_xfrinfo
 *
 * Description:
 *   Allocate an asynchronous data structure from the free list
 *
 * Assumptions:
 *   - Never called from an interrupt handler.
 *   - Protection from re-entrance must be assured by the caller
 *
 ****************************************************************************/

static struct lpc17_40_xfrinfo_s *lpc17_40_alloc_xfrinfo(void)
{
  struct lpc17_40_xfrinfo_s *ret;
  irqstate_t flags;

  /* lpc17_40_free_xfrinfo() may be called from the interrupt level */

  flags = enter_critical_section();
  ret = (struct lpc17_40_xfrinfo_s *)g_xfrfree;
  if (ret)
    {
      g_xfrfree = ((struct lpc17_40_list_s *)ret)->flink;
    }

  leave_critical_section(flags);
  return ret;
}

/****************************************************************************
 * Name: lpc17_40_freeio
 *
 * Description:
 *   Return an TD buffer to the free list
 *
 ****************************************************************************/

static void lpc17_40_free_xfrinfo(struct lpc17_40_xfrinfo_s *xfrinfo)
{
  struct lpc17_40_list_s *node;
  irqstate_t flags;

  /* Could be called from the interrupt level */

  flags        = enter_critical_section();
  node         = (struct lpc17_40_list_s *)xfrinfo;
  node->flink  = g_xfrfree;
  g_xfrfree    = node;
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: lpc17_40_addctrled
 *
 * Description:
 *   Helper function to add an ED to the control list.
 *
 ****************************************************************************/

static inline int lpc17_40_addctrled(struct lpc17_40_usbhost_s *priv,
                                     struct lpc17_40_ed_s *ed)
{
  irqstate_t flags;
  uint32_t regval;

  /* Disable control list processing while we modify the list */

  flags   = enter_critical_section();
  regval = lpc17_40_getreg(LPC17_40_USBHOST_CTRL);
  regval &= ~OHCI_CTRL_CLE;
  lpc17_40_putreg(regval, LPC17_40_USBHOST_CTRL);

  /* Add the new bulk ED to the head of the bulk list */

  ed->hw.nexted = lpc17_40_getreg(LPC17_40_USBHOST_CTRLHEADED);
  lpc17_40_putreg((uint32_t)ed, LPC17_40_USBHOST_CTRLHEADED);

  /* Re-enable control list processing. */

  lpc17_40_putreg(0, LPC17_40_USBHOST_CTRLED);

  regval = lpc17_40_getreg(LPC17_40_USBHOST_CTRL);
  regval |= OHCI_CTRL_CLE;
  lpc17_40_putreg(regval, LPC17_40_USBHOST_CTRL);

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: lpc17_40_remctrled
 *
 * Description:
 *   Helper function remove an ED from the control list.
 *
 ****************************************************************************/

static inline int lpc17_40_remctrled(struct lpc17_40_usbhost_s *priv,
                                     struct lpc17_40_ed_s *ed)
{
  struct lpc17_40_ed_s *curr;
  struct lpc17_40_ed_s *prev;
  struct lpc17_40_ed_s *head;
  irqstate_t flags;
  uint32_t regval;

  /* Disable control list processing while we modify the list */

  flags   = enter_critical_section();
  regval = lpc17_40_getreg(LPC17_40_USBHOST_CTRL);
  regval &= ~OHCI_CTRL_CLE;
  lpc17_40_putreg(regval, LPC17_40_USBHOST_CTRL);

  /* Find the ED in the control list. */

