apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_usbhost.c
  head = (struct lpc17_40_ed_s *)
    lpc17_40_getreg(LPC17_40_USBHOST_CTRLHEADED);

  for (prev = NULL, curr = head;
       curr && curr != ed;
       prev = curr, curr = (struct lpc17_40_ed_s *)curr->hw.nexted)
    {
    }

  /* It would be a bug if we do not find the ED in the control list. */

  DEBUGASSERT(curr != NULL);

  /* Remove the ED from the control list */

  if (curr != NULL)
    {
      /* Is this ED the first on in the control list? */

      if (prev == NULL)
        {
          /* Yes... set the head of the control list to skip over this ED */

          head = (struct lpc17_40_ed_s *)ed->hw.nexted;
          lpc17_40_putreg((uint32_t)head, LPC17_40_USBHOST_CTRLHEADED);
        }
      else
        {
          /* No.. set the forward link of the previous ED in the list
           * skip over this ED.
           */

          prev->hw.nexted = ed->hw.nexted;
        }

      /* Just in case the hardware happens to be processing this ed now...
       * it should go back to the control list head.
       */

      ed->hw.nexted = 0;
    }

  /* Re-enable control list processing if the control list is still non-empty
   * after removing the ED node.
   */

  lpc17_40_putreg(0, LPC17_40_USBHOST_CTRLED);
  if (lpc17_40_getreg(LPC17_40_USBHOST_CTRLHEADED) != 0)
    {
      /* If the control list is now empty, then disable it */

      regval  = lpc17_40_getreg(LPC17_40_USBHOST_CTRL);
      regval &= ~OHCI_CTRL_CLE;
      lpc17_40_putreg(regval, LPC17_40_USBHOST_CTRL);
    }

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: lpc17_40_addbulked
 *
 * Description:
 *   Helper function to add an ED to the bulk list.
 *
 ****************************************************************************/

static inline int lpc17_40_addbulked(struct lpc17_40_usbhost_s *priv,
                                     struct lpc17_40_ed_s *ed)
{
#ifndef CONFIG_USBHOST_BULK_DISABLE
  irqstate_t flags;
  uint32_t regval;

  /* Disable bulk list processing while we modify the list */

  flags   = enter_critical_section();
  regval  = lpc17_40_getreg(LPC17_40_USBHOST_CTRL);
  regval &= ~OHCI_CTRL_BLE;
  lpc17_40_putreg(regval, LPC17_40_USBHOST_CTRL);

  /* Add the new bulk ED to the head of the bulk list */

  ed->hw.nexted = lpc17_40_getreg(LPC17_40_USBHOST_BULKHEADED);
  lpc17_40_putreg((uint32_t)ed, LPC17_40_USBHOST_BULKHEADED);

  /* Re-enable bulk list processing. */

  lpc17_40_putreg(0, LPC17_40_USBHOST_BULKED);

  regval  = lpc17_40_getreg(LPC17_40_USBHOST_CTRL);
  regval |= OHCI_CTRL_BLE;
  lpc17_40_putreg(regval, LPC17_40_USBHOST_CTRL);

  leave_critical_section(flags);
  return OK;
#else
  return -ENOSYS;
#endif
}

/****************************************************************************
 * Name: lpc17_40_rembulked
 *
 * Description:
 *   Helper function remove an ED from the bulk list.
 *
 ****************************************************************************/

static inline int lpc17_40_rembulked(struct lpc17_40_usbhost_s *priv,
                                     struct lpc17_40_ed_s *ed)
{
#ifndef CONFIG_USBHOST_BULK_DISABLE
  struct lpc17_40_ed_s *curr;
  struct lpc17_40_ed_s *prev;
  struct lpc17_40_ed_s *head;
  irqstate_t flags;
  uint32_t regval;

  /* Disable bulk list processing while we modify the list */

  flags   = enter_critical_section();
  regval  = lpc17_40_getreg(LPC17_40_USBHOST_CTRL);
  regval &= ~OHCI_CTRL_BLE;
  lpc17_40_putreg(regval, LPC17_40_USBHOST_CTRL);

  /* Find the ED in the bulk list. */

  head = (struct lpc17_40_ed_s *)
    lpc17_40_getreg(LPC17_40_USBHOST_BULKHEADED);

  for (prev = NULL, curr = head;
       curr && curr != ed;
       prev = curr, curr = (struct lpc17_40_ed_s *)curr->hw.nexted)
    {
    }

  /* It would be a bug if we do not find the ED in the bulk list. */

  DEBUGASSERT(curr != NULL);

  /* Remove the ED from the bulk list */

  if (curr != NULL)
    {
      /* Is this ED the first on in the bulk list? */

      if (prev == NULL)
        {
          /* Yes... set the head of the bulk list to skip over this ED */

          head = (struct lpc17_40_ed_s *)ed->hw.nexted;
          lpc17_40_putreg((uint32_t)head, LPC17_40_USBHOST_BULKHEADED);
        }
      else
        {
          /* No.. set the forward link of the previous ED in the list
           * skip over this ED.
           */

          prev->hw.nexted = ed->hw.nexted;
        }
    }

  /* Re-enable bulk list processing if the bulk list is still non-empty
   * after removing the ED node.
   */

  lpc17_40_putreg(0, LPC17_40_USBHOST_BULKED);
  if (lpc17_40_getreg(LPC17_40_USBHOST_BULKHEADED) != 0)
    {
      /* If the bulk list is now empty, then disable it */

      regval  = lpc17_40_getreg(LPC17_40_USBHOST_CTRL);
      regval |= OHCI_CTRL_BLE;
      lpc17_40_putreg(regval, LPC17_40_USBHOST_CTRL);
    }

  leave_critical_section(flags);
  return OK;
#else
  return -ENOSYS;
#endif
}

/****************************************************************************
 * Name: lpc17_40_getinterval
 *
 * Description:
 *   Convert the endpoint polling interval into a HCCA table increment
 *
 ****************************************************************************/

#if !defined(CONFIG_USBHOST_INT_DISABLE) || !defined(CONFIG_USBHOST_ISOC_DISABLE)
static unsigned int lpc17_40_getinterval(uint8_t interval)
{
  /* The bInterval field of the endpoint descriptor contains the polling
   * interval for interrupt and isochronous endpoints. For other types of
   * endpoint, this value should be ignored. bInterval is provided in units
   * of 1MS frames.
   */

  if (interval < 3)
    {
      return 2;
    }
  else if (interval < 7)
    {
      return 4;
    }
  else if (interval < 15)
    {
      return 8;
    }
  else if (interval < 31)
    {
      return 16;
    }
  else
    {
      return 32;
    }
}
#endif

/****************************************************************************
 * Name: lpc17_40_setinttab
 *
 * Description:
 *   Set the interrupt table to the selected value using the provided
 *   interval and offset.
 *
 ****************************************************************************/

#if !defined(CONFIG_USBHOST_INT_DISABLE) || !defined(CONFIG_USBHOST_ISOC_DISABLE)
static void lpc17_40_setinttab(uint32_t value, unsigned int interval,
                               unsigned int offset)
{
  unsigned int i;
  for (i = offset; i < HCCA_INTTBL_WSIZE; i += interval)
    {
      HCCA->inttbl[i] = value;
    }
}
#endif

/****************************************************************************
 * Name: lpc17_40_addinted
 *
 * Description:
 *   Helper function to add an ED to the HCCA interrupt table.
 *
 *   To avoid reshuffling the table so much and to keep life simple in
 *   general, the following rules are applied:
 *
 *     1. IN EDs get the even entries, OUT EDs get the odd entries.
 *     2. Add IN/OUT EDs are scheduled together at the minimum interval of
 *        all IN/OUT EDs.
 *
 *   This has the following consequences:
 *
 *     1. The minimum support polling rate is 2MS, and
 *     2. Some devices may get polled at a much higher rate than they
 *        request.
 *
 ****************************************************************************/

static inline int lpc17_40_addinted(struct lpc17_40_usbhost_s *priv,
                                    const struct usbhost_epdesc_s *epdesc,
                                    struct lpc17_40_ed_s *ed)
{
#ifndef CONFIG_USBHOST_INT_DISABLE
  unsigned int interval;
  unsigned int offset;
  uint32_t head;
  uint32_t regval;

  /* Disable periodic list processing.  Does this take effect immediately?
   * Or at the next SOF... need to check.
   */

