apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_usbhost.c
  regval  = lpc17_40_getreg(LPC17_40_USBHOST_CTRL);
  regval &= ~OHCI_CTRL_PLE;
  lpc17_40_putreg(regval, LPC17_40_USBHOST_CTRL);

  /* Get the quantized interval value associated with this ED and save it
   * in the ED.
   */

  interval     = lpc17_40_getinterval(epdesc->interval);
  ed->interval = interval;
  uinfo("interval: %d->%d\n", epdesc->interval, interval);

  /* Get the offset associated with the ED direction. IN EDs get the even
   * entries, OUT EDs get the odd entries.
   *
   * Get the new, minimum interval. Add IN/OUT EDs are scheduled together
   * at the minimum interval of all IN/OUT EDs.
   */

  if (epdesc->in)
    {
      offset = 0;
      if (priv->ininterval > interval)
        {
          priv->ininterval = interval;
        }
      else
        {
          interval = priv->ininterval;
        }
    }
  else
    {
      offset = 1;
      if (priv->outinterval > interval)
        {
          priv->outinterval = interval;
        }
      else
        {
          interval = priv->outinterval;
        }
    }

  uinfo("min interval: %d offset: %d\n", interval, offset);

  /* Get the head of the first of the duplicated entries.  The first offset
   * entry is always guaranteed to contain the common ED list head.
   */

  head = HCCA->inttbl[offset];

  /* Clear all current entries in the interrupt table for this direction */

  lpc17_40_setinttab(0, 2, offset);

  /* Add the new ED before the old head of the periodic ED list and set the
   * new ED as the head ED in all of the appropriate entries of the HCCA
   * interrupt table.
   */

  ed->hw.nexted = head;
  lpc17_40_setinttab((uint32_t)ed, interval, offset);
  uinfo("head: %p next: %08" PRIx32 "\n", ed, head);

  /* Re-enabled periodic list processing */

  regval  = lpc17_40_getreg(LPC17_40_USBHOST_CTRL);
  regval |= OHCI_CTRL_PLE;
  lpc17_40_putreg(regval, LPC17_40_USBHOST_CTRL);
  return OK;
#else
  return -ENOSYS;
#endif
}

/****************************************************************************
 * Name: lpc17_40_reminted
 *
 * Description:
 *   Helper function to remove an ED from the HCCA interrupt table.
 *
 *   To avoid reshuffling the table so much and to keep life simple in
 *   general, the following rules are applied:
 *
 *     1. IN EDs get the even entries, OUT EDs get the odd entries.
 *     2. Add IN/OUT EDs are scheduled together at the minimum interval of
 *        all IN/OUT EDs.
 *
 *   This has the following consequences:
 *
 *     1. The minimum support polling rate is 2MS, and
 *     2. Some devices may get polled at a much higher rate than they
 *        request.
 *
 ****************************************************************************/

static inline int lpc17_40_reminted(struct lpc17_40_usbhost_s *priv,
                                    struct lpc17_40_ed_s *ed)
{
#ifndef CONFIG_USBHOST_INT_DISABLE
  struct lpc17_40_ed_s *head;
  struct lpc17_40_ed_s *curr;
  struct lpc17_40_ed_s *prev;
  unsigned int          interval;
  unsigned int          offset;
  uint32_t              regval;

  /* Disable periodic list processing.  Does this take effect immediately?
   * Or at the next SOF... need to check.
   */

  regval  = lpc17_40_getreg(LPC17_40_USBHOST_CTRL);
  regval &= ~OHCI_CTRL_PLE;
  lpc17_40_putreg(regval, LPC17_40_USBHOST_CTRL);

  /* Get the offset associated with the ED direction. IN EDs get the even
   * entries, OUT EDs get the odd entries.
   */

  if ((ed->hw.ctrl & ED_CONTROL_D_MASK) == ED_CONTROL_D_IN)
    {
      offset = 0;
    }
  else
    {
      offset = 1;
    }

  /* Get the head of the first of the duplicated entries.  The first offset
   * entry is always guaranteed to contain the common ED list head.
   */

  head = (struct lpc17_40_ed_s *)HCCA->inttbl[offset];
  uinfo("ed: %p head: %p next: %08" PRIx32 " offset: %d\n",
        ed, head, head ? head->hw.nexted : 0, offset);

  /* Find the ED to be removed in the ED list */

  for (curr = head, prev = NULL;
       curr && curr != ed;
       prev = curr, curr = (struct lpc17_40_ed_s *)curr->hw.nexted);

  /* Hmmm.. It would be a bug if we do not find the ED in the bulk list. */

  DEBUGASSERT(curr != NULL);
  if (curr != NULL)
    {
      /* Clear all current entries in the interrupt table for this
       * direction
       */

      lpc17_40_setinttab(0, 2, offset);

      /* Remove the ED from the list..  Is this ED the first on in the
       * list?
       */

      if (prev == NULL)
        {
          /* Yes... set the head of the bulk list to skip over this ED */

          head = (struct lpc17_40_ed_s *)ed->hw.nexted;
        }
      else
        {
          /* No.. set the forward link of the previous ED in the list
           * skip over this ED.
           */

          prev->hw.nexted = ed->hw.nexted;
        }

        uinfo("ed: %p head: %p next: %08" PRIx32 "\n",
              ed, head, head ? head->hw.nexted : 0);

      /* Calculate the new minimum interval for this list */

      interval = MAX_PERINTERVAL;
      for (curr = head; curr; curr = (struct lpc17_40_ed_s *)curr->hw.nexted)
        {
          if (curr->interval < interval)
            {
              interval = curr->interval;
            }
        }

      uinfo("min interval: %d offset: %d\n", interval, offset);

      /* Save the new minimum interval */

      if ((ed->hw.ctrl & ED_CONTROL_D_MASK) == ED_CONTROL_D_IN)
        {
          priv->ininterval  = interval;
        }
      else
        {
          priv->outinterval = interval;
        }

      /* Set the head ED in all of the appropriate entries of the HCCA
       * interrupt table (head might be NULL).
       */

      lpc17_40_setinttab((uint32_t)head, interval, offset);
    }

  /* Re-enabled periodic list processing */

  if (head != NULL)
    {
      regval  = lpc17_40_getreg(LPC17_40_USBHOST_CTRL);
      regval |= OHCI_CTRL_PLE;
      lpc17_40_putreg(regval, LPC17_40_USBHOST_CTRL);
    }

  return OK;
#else
  return -ENOSYS;
#endif
}

/****************************************************************************
 * Name: lpc17_40_addisoced
 *
 * Description:
 *   Helper functions to add an ED to the periodic table.
 *
 ****************************************************************************/

static inline int lpc17_40_addisoced(struct lpc17_40_usbhost_s *priv,
                                     const struct usbhost_epdesc_s *epdesc,
                                     struct lpc17_40_ed_s *ed)
{
#ifndef CONFIG_USBHOST_ISOC_DISABLE
#  warning "Isochronous endpoints not yet supported"
#endif
  return -ENOSYS;
}

/****************************************************************************
 * Name: lpc17_40_remisoced
 *
 * Description:
 *   Helper functions to remove an ED from the periodic table.
 *
 ****************************************************************************/

static inline int lpc17_40_remisoced(struct lpc17_40_usbhost_s *priv,
                                     struct lpc17_40_ed_s *ed)
{
#ifndef CONFIG_USBHOST_ISOC_DISABLE
#  warning "Isochronous endpoints not yet supported"
#endif
  return -ENOSYS;
}

/****************************************************************************
 * Name: lpc17_40_enqueuetd
 *
 * Description:
 *   Enqueue a transfer descriptor.  Notice that this function only supports
 *   queue on TD per ED.
 *
 ****************************************************************************/

static int lpc17_40_enqueuetd(struct lpc17_40_usbhost_s *priv,
                              struct lpc17_40_ed_s *ed, uint32_t dirpid,
                              uint32_t toggle, volatile uint8_t *buffer,
                              size_t buflen)
{
  struct lpc17_40_gtd_s *td;
  int ret = -ENOMEM;

  /* Allocate a TD from the free list */

