apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_usbhost.c
  td = lpc17_40_tdalloc();
  if (td != NULL)
    {
      /* Initialize the allocated TD and link it before the common tail TD. */

      td->hw.ctrl         = (GTD_STATUS_R | dirpid | TD_DELAY(0) | toggle |
                             GTD_STATUS_CC_MASK);
      TDTAIL->hw.ctrl     = 0;
      td->hw.cbp          = (uint32_t)buffer;
      TDTAIL->hw.cbp      = 0;
      td->hw.nexttd       = (uint32_t)TDTAIL;
      TDTAIL->hw.nexttd   = 0;
      td->hw.be           = (uint32_t)(buffer + (buflen - 1));
      TDTAIL->hw.be       = 0;

      /* Configure driver-only fields in the extended TD structure */

      td->ed              = ed;

      /* Link the td to the head of the ED's TD list */

      ed->hw.headp        = (uint32_t)td | ((ed->hw.headp) & ED_HEADP_C);
      ed->hw.tailp        = (uint32_t)TDTAIL;

      ret                 = OK;
    }

  return ret;
}

/****************************************************************************
 * Name: lpc17_40_wdhwait
 *
 * Description:
 *   Set the request for the Writeback Done Head event well BEFORE enabling
 *   the transfer (as soon as we are absolutely committed to the to avoid
 *   transfer).  We do this to minimize race conditions.  This logic would
 *   have to be expanded if we want to have more than one packet in flight
 *   at a time!
 *
 ****************************************************************************/

static int lpc17_40_wdhwait(struct lpc17_40_usbhost_s *priv,
                            struct lpc17_40_ed_s *ed)
{
  struct lpc17_40_xfrinfo_s *xfrinfo;
  irqstate_t flags = enter_critical_section();
  int        ret   = -ENODEV;

  DEBUGASSERT(ed && ed->xfrinfo);
  xfrinfo = ed->xfrinfo;

  /* Is the device still connected? */

  if (priv->connected)
    {
      /* Yes.. then set wdhwait to indicate that we expect to be informed
       * when either (1) the device is disconnected, or (2) the transfer
       * completed.
       */

      xfrinfo->wdhwait = true;
      ret = OK;
    }

  leave_critical_section(flags);
  return ret;
}

/****************************************************************************
 * Name: lpc17_40_ctrltd
 *
 * Description:
 *   Process a IN or OUT request on the control endpoint.  This function
 *   will enqueue the request and wait for it to complete.  Only one
 *   transfer may be queued; Neither these methods nor the transfer() method
 *   can be called again until the control transfer functions returns.
 *
 *   These are blocking methods; these functions will not return until the
 *   control transfer has completed.
 *
 ****************************************************************************/

static int lpc17_40_ctrltd(struct lpc17_40_usbhost_s *priv,
                           struct lpc17_40_ed_s *ed, uint32_t dirpid,
                           uint8_t *buffer, size_t buflen)
{
  struct lpc17_40_xfrinfo_s *xfrinfo;
  uint32_t toggle;
  uint32_t regval;
  int ret;

  /* Allocate a structure to retain the information needed when the transfer
   * completes.
   */

  DEBUGASSERT(ed->xfrinfo == NULL);

  xfrinfo = lpc17_40_alloc_xfrinfo();
  if (xfrinfo == NULL)
    {
      uerr("ERROR: lpc17_40_alloc_xfrinfo failed\n");
      return -ENOMEM;
    }

  /* Initialize the transfer structure */

  memset(xfrinfo, 0, sizeof(struct lpc17_40_xfrinfo_s));
  xfrinfo->buffer = buffer;
  xfrinfo->buflen = buflen;

  ed->xfrinfo = xfrinfo;

  /* Set the request for the Writeback Done Head event well BEFORE enabling
   * the transfer.
   */

  ret = lpc17_40_wdhwait(priv, ed);
  if (ret < 0)
    {
      uerr("ERROR: Device disconnected\n");
      goto errout_with_xfrinfo;
    }

  /* Configure the toggle field in the TD */

  if (dirpid == GTD_STATUS_DP_SETUP)
    {
      toggle = GTD_STATUS_T_DATA0;
    }
  else
    {
      toggle = GTD_STATUS_T_DATA1;
    }

  /* Then enqueue the transfer */

  xfrinfo->tdstatus = TD_CC_NOERROR;
  ret = lpc17_40_enqueuetd(priv, ed, dirpid, toggle, buffer, buflen);
  if (ret == OK)
    {
      /* Set ControlListFilled.  This bit is used to indicate whether there
       * are TDs on the Control list.
       */

      regval = lpc17_40_getreg(LPC17_40_USBHOST_CMDST);
      regval |= OHCI_CMDST_CLF;
      lpc17_40_putreg(regval, LPC17_40_USBHOST_CMDST);

      /* Wait for the Writeback Done Head interrupt */

      ret = nxsem_wait_uninterruptible(&ed->wdhsem);
      if (ret < 0)
        {
          /* Task has been canceled */
        }

      /* Check the TD completion status bits */

      else if (xfrinfo->tdstatus == TD_CC_NOERROR)
        {
          ret = OK;
        }
      else
        {
          uerr("ERROR: Bad TD completion status: %d\n", xfrinfo->tdstatus);
          ret = xfrinfo->tdstatus == TD_CC_STALL ? -EPERM : -EIO;
        }
    }

  /* Make sure that there is no outstanding request on this endpoint */

errout_with_xfrinfo:
  lpc17_40_free_xfrinfo(xfrinfo);
  ed->xfrinfo = NULL;
  return ret;
}

/****************************************************************************
 * Name: lpc17_40_usbinterrupt
 *
 * Description:
 *   USB interrupt handler
 *
 ****************************************************************************/

static int lpc17_40_usbinterrupt(int irq, void *context, void *arg)
{
  struct lpc17_40_usbhost_s *priv = &g_usbhost;
  struct lpc17_40_ed_s *ed;
  struct lpc17_40_xfrinfo_s *xfrinfo;
  uintptr_t tmp;
  uint32_t intst;
  uint32_t pending;
  uint32_t regval;

  /* Read Interrupt Status and mask out interrupts that are not enabled. */

  intst  = lpc17_40_getreg(LPC17_40_USBHOST_INTST);
  regval = lpc17_40_getreg(LPC17_40_USBHOST_INTEN);
  uinfo("INST: %08" PRIx32 " INTEN: %08" PRIx32 "\n", intst, regval);

  pending = intst & regval;
  if (pending != 0)
    {
      /* Root hub status change interrupt */

      if ((pending & OHCI_INT_RHSC) != 0)
        {
          uint32_t rhportst1 = lpc17_40_getreg(LPC17_40_USBHOST_RHPORTST1);
          uinfo("Root Hub Status Change, RHPORTST1: %08" PRIx32 "\n",
                rhportst1);

          if ((rhportst1 & OHCI_RHPORTST_CSC) != 0)
            {
              uint32_t rhstatus = lpc17_40_getreg(LPC17_40_USBHOST_RHSTATUS);
              uinfo("Connect Status Change, RHSTATUS: %08" PRIx32 "\n",
                    rhstatus);

              /* If DRWE is set, Connect Status Change indicates a remote
               * wake-up event
               */

              if (rhstatus & OHCI_RHSTATUS_DRWE)
                {
                  uinfo("DRWE: Remote wake-up\n");
                }

              /* Otherwise... Not a remote wake-up event */

              else
                {
                  /* Check current connect status */

