apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_usbhost.c
                  if ((rhportst1 & OHCI_RHPORTST_CCS) != 0)
                    {
                      /* Connected ... Did we just become connected? */

                      if (!priv->connected)
                        {
                          /* Yes.. connected. */

                          uinfo("Connected\n");
                          priv->connected = true;
                          priv->change    = true;

                          /* Notify any waiters */

                          if (priv->pscwait)
                            {
                              nxsem_post(&priv->pscsem);
                              priv->pscwait = false;
                            }
                        }
                      else
                        {
                          uwarn("WARNING: Spurious status change "
                                "(connected)\n");
                        }

                      /* The LSDA (Low speed device attached) bit is valid
                       * when CCS == 1.
                       */

                      if ((rhportst1 & OHCI_RHPORTST_LSDA) != 0)
                        {
                          priv->rhport.hport.speed = USB_SPEED_LOW;
                        }
                      else
                        {
                          priv->rhport.hport.speed = USB_SPEED_FULL;
                        }

                      uinfo("Speed:%d\n", priv->rhport.hport.speed);
                    }

                  /* Check if we are now disconnected */

                  else if (priv->connected)
                    {
                      /* Yes.. disconnect the device */

                      uinfo("Disconnected\n");
                      priv->connected = false;
                      priv->change    = true;

                      /* Set the port speed to the default (FULL).  We cannot
                       * yet free the function address.  That has to be done
                       * by the class when responds to the disconnection.
                       */

                      priv->rhport.hport.speed = USB_SPEED_FULL;

                      /* Are we bound to a class instance? */

                      if (priv->rhport.hport.devclass)
                        {
                          /* Yes.. Disconnect the class */

                          CLASS_DISCONNECTED(priv->rhport.hport.devclass);
                          priv->rhport.hport.devclass = NULL;
                        }

                      /* Notify any waiters for the Root Hub Status change
                       * event
                       */

                      if (priv->pscwait)
                        {
                          nxsem_post(&priv->pscsem);
                          priv->pscwait = false;
                        }
                    }
                  else
                    {
                       uwarn("WARNING: Spurious status change "
                             "(disconnected)\n");
                    }
                }

              /* Clear the status change interrupt */

              lpc17_40_putreg(OHCI_RHPORTST_CSC,
                              LPC17_40_USBHOST_RHPORTST1);
            }

          /* Check for port reset status change */

          if ((rhportst1 & OHCI_RHPORTST_PRSC) != 0)
            {
              /* Release the RH port from reset */

              lpc17_40_putreg(OHCI_RHPORTST_PRSC,
                              LPC17_40_USBHOST_RHPORTST1);
            }
        }

      /* Writeback Done Head interrupt */

      if ((pending & OHCI_INT_WDH) != 0)
        {
          struct lpc17_40_gtd_s *td;
          struct lpc17_40_gtd_s *next;

          /* The host controller just wrote the list of finished TDs into
           * the HCCA done head.  This may include multiple packets that
           * were transferred in the preceding frame.
           *
           * Remove the TD(s) from the Writeback Done Head in the HCCA and
           * return them to the free list.  Note that this is safe because
           * the hardware will not modify the writeback done head again
           * until the WDH bit is cleared in the interrupt status register.
           */

          td = (struct lpc17_40_gtd_s *)
            (HCCA->donehead & HCCA_DONEHEAD_MASK);
          HCCA->donehead = 0;
          next = NULL;

          /* Process each TD in the write done list */

          for (; td; td = next)
            {
              /* REVISIT: I have encountered bad TDs in the done list linked
               * after at least one good TD.  This is some consequence of how
               * transfers are being cancelled.  But for now, I have only
               * this work-around.
               */

              if ((uintptr_t)td < LPC17_40_TDFREE_BASE ||
                  (uintptr_t)td >= (LPC17_40_TDFREE_BASE +
                                    LPC17_40_TD_SIZE *
                                    CONFIG_LP17_USBHOST_NTDS))
                {
                  break;
                }

              /* Get the ED in which this TD was enqueued */

              ed      = td->ed;
              DEBUGASSERT(ed != NULL);

              /* If there is a transfer in progress, then the xfrinfo
               * pointer will be non-NULL.  But it appears that a NULL
               * pointer may be received with a spurious interrupt such as
               * may occur after a transfer is cancelled.
               */

              xfrinfo = ed->xfrinfo;
              if (xfrinfo)
                {
                  /* Save the condition code from the (single) TD
                   * status/control word.
                   */

                  xfrinfo->tdstatus = (td->hw.ctrl & GTD_STATUS_CC_MASK) >>
                                       GTD_STATUS_CC_SHIFT;

#ifdef CONFIG_DEBUG_USB
                  if (xfrinfo->tdstatus != TD_CC_NOERROR)
                    {
                      /* The transfer failed for some reason... dump some
                       * diagnostic info.
                       */

                      uerr("ERROR: ED xfrtype:%d TD CTRL:%08x/CC:%d "
                           "RHPORTST1:%08x\n",
                           ed->xfrtype, td->hw.ctrl, xfrinfo->tdstatus,
                           lpc17_40_getreg(LPC17_40_USBHOST_RHPORTST1));
                    }
#endif

                  /* Determine the number of bytes actually transfer by
                   * subtracting the buffer start address from the CBP.  A
                   * value of zero means that all bytes were transferred.
                   */

                  tmp = (uintptr_t)td->hw.cbp;
                  if (tmp == 0)
                    {
                      /* Set the (fake) CBP to the end of the buffer + 1 */

                      tmp = xfrinfo->buflen;
                    }
                  else
                    {
                      DEBUGASSERT(tmp >= (uintptr_t)xfrinfo->buffer);

                      /* Determine the size of the transfer by subtracting
                       * the current buffer pointer (CBP) from the initial
                       * buffer pointer (on packet receipt only).
                       */

                      tmp -= (uintptr_t)xfrinfo->buffer;
                      DEBUGASSERT(tmp < UINT16_MAX);
                    }

