apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_usbhost.c
  if (in)
    {
      dirpid = GTD_STATUS_DP_IN;
    }
  else
    {
      dirpid = GTD_STATUS_DP_OUT;
    }

  /* Then enqueue the transfer */

  xfrinfo->tdstatus = TD_CC_NOERROR;
  ret = lpc17_40_enqueuetd(priv, ed, dirpid, GTD_STATUS_T_TOGGLE, buffer,
                           buflen);
  if (ret == OK)
    {
      /* BulkListFilled. This bit is used to indicate whether there are any
       * TDs on the Bulk list.
       */

      if (ed->xfrtype == USB_EP_ATTR_XFER_BULK)
        {
          regval  = lpc17_40_getreg(LPC17_40_USBHOST_CMDST);
          regval |= OHCI_CMDST_BLF;
          lpc17_40_putreg(regval, LPC17_40_USBHOST_CMDST);
        }
    }

  return ret;
}

/****************************************************************************
 * Name: lpc17_40_dma_alloc
 *
 * Description:
 *   Allocate DMA memory to perform a transfer, copying user data as
 *   necessary
 *
 * Input Parameters:
 *   priv - Internal driver state structure.
 *   ed - The IN or OUT endpoint descriptor for the device endpoint on
 *     which to perform the transfer.
 *   userbuffer - The user buffer containing the data to be sent (OUT
 *     endpoint) or received (IN endpoint).
 *   buflen - The length of the data to be sent or received.
 *   alloc - The location to return the allocated DMA buffer.
 *
 * Returned Value:
 *   On success, zero (OK) is returned. On a failure, a negated errno value
 *   is returned indicating the nature of the failure.
 *
 * Assumptions:
 *   - Called from a single thread so no mutual exclusion is required.
 *   - Never called from an interrupt handler.
 *
 ****************************************************************************/

#if LPC17_40_IOBUFFERS > 0
static int lpc17_40_dma_alloc(struct lpc17_40_usbhost_s *priv,
                              struct lpc17_40_ed_s *ed, uint8_t *userbuffer,
                              size_t buflen, uint8_t **alloc)
{
  uint8_t *newbuffer;

  if ((uintptr_t)userbuffer < LPC17_40_SRAM_BANK0 ||
      (uintptr_t)userbuffer >= (LPC17_40_SRAM_BANK0 + LPC17_40_BANK0_SIZE +
                                LPC17_40_BANK1_SIZE))
    {
      /* Will the transfer fit in an IO buffer? */

      if (buflen > CONFIG_LPC17_40_USBHOST_IOBUFSIZE)
        {
          uinfo("buflen (%d) > IO buffer size (%d)\n",
                 buflen, CONFIG_LPC17_40_USBHOST_IOBUFSIZE);
          return -ENOMEM;
        }

      /* Allocate an IO buffer in AHB SRAM */

      newbuffer = lpc17_40_allocio();
      if (!newbuffer)
        {
          uinfo("IO buffer allocation failed\n");
          return -ENOMEM;
        }

      /* If this is an OUT transaction, copy the user data into the AHB
       * SRAM IO buffer.  Sad... so inefficient.  But without exposing
       * the AHB SRAM to the final, end-user client I don't know of any
       * way around this copy.
       */

      if ((ed->hw.ctrl & ED_CONTROL_D_MASK) != ED_CONTROL_D_IN)
        {
          memcpy(newbuffer, userbuffer, buflen);
        }

      /* Return the allocated buffer */

      *alloc = newbuffer;
    }

  return OK;
}

/****************************************************************************
 * Name: lpc17_40_dma_free
 *
 * Description:
 *   Free allocated DMA memory.
 *
 * Input Parameters:
 *   priv - Internal driver state structure.
 *   ed - The IN or OUT endpoint descriptor for the device endpoint on
 *     which to perform the transfer.
 *   userbuffer - The user buffer containing the data to be sent (OUT
 *     endpoint) or received (IN endpoint).
 *   buflen - The length of the data to be sent or received.
 *   alloc - The allocated DMA buffer to be freed.
 *
 * Returned Value:
 *   On success, zero (OK) is returned. On a failure, a negated errno value
 *   is returned indicating the nature of the failure.
 *
 * Assumptions:
 *   - Called from a single thread so no mutual exclusion is required.
 *   - Never called from an interrupt handler.
 *
 ****************************************************************************/

static void lpc17_40_dma_free(struct lpc17_40_usbhost_s *priv,
                              struct lpc17_40_ed_s *ed, uint8_t *userbuffer,
                              size_t buflen, uint8_t *newbuffer)
{
  irqstate_t flags;

  /* Could be called from the interrupt level */

  flags = enter_critical_section();
  if (userbuffer && newbuffer)
    {
      /* If this is an IN transaction, get the user data from the AHB
       * SRAM IO buffer.  Sad... so inefficient.  But without exposing
       * the AHB SRAM to the final, end-user client I don't know of any
       * way around this copy.
       */

      if ((ed->hw.ctrl & ED_CONTROL_D_MASK) == ED_CONTROL_D_IN)
        {
          memcpy(userbuffer, newbuffer, buflen);
        }

      /* Then free the temporary I/O buffer */

      lpc17_40_freeio(newbuffer);
    }

  leave_critical_section(flags);
}
#endif

/****************************************************************************
 * Name: lpc17_40_transfer
 *
 * Description:
 *   Process a request to handle a transfer descriptor.  This method will
 *   enqueue the transfer request, blocking until the transfer completes.
 *   Only one transfer may be  queued; Neither this method nor the ctrlin or
 *   ctrlout methods can be called again until this function returns.
 *
 *   This is a blocking method; this functions will not return until the
 *   transfer has completed.
 *
 * Input Parameters:
 *   drvr - The USB host driver instance obtained as a parameter from the
 *     call to the class create() method.
 *   ep - The IN or OUT endpoint descriptor for the device endpoint on which
 *     to perform the transfer.
 *   buffer - A buffer containing the data to be sent (OUT endpoint) or
 *     received (IN endpoint).  buffer must have been allocated using
 *     DRVR_ALLOC
 *   buflen - The length of the data to be sent or received.
 *
 * Returned Value:
 *   On success, a non-negative value is returned that indicates the number
 *   of bytes successfully transferred.  On a failure, a negated errno value
 *   is returned that indicates the nature of the failure:
 *
 *     EAGAIN - If devices NAKs the transfer (or NYET or other error where
 *              it may be appropriate to restart the entire transaction).
 *     EPERM  - If the endpoint stalls
 *     EIO    - On a TX or data toggle error
 *     EPIPE  - Overrun errors
 *
 * Assumptions:
 *   - Called from a single thread so no mutual exclusion is required.
 *   - Never called from an interrupt handler.
 *
 ****************************************************************************/

