apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_usbhost.c
static ssize_t lpc17_40_transfer(struct usbhost_driver_s *drvr,
                                 usbhost_ep_t ep, uint8_t *buffer,
                                 size_t buflen)
{
  struct lpc17_40_usbhost_s *priv = (struct lpc17_40_usbhost_s *)drvr;
  struct lpc17_40_ed_s *ed = (struct lpc17_40_ed_s *)ep;
  struct lpc17_40_xfrinfo_s *xfrinfo;
#if LPC17_40_IOBUFFERS > 0
  uint8_t *alloc = NULL;
  uint8_t *userbuffer = NULL;
#endif
  ssize_t nbytes;
  int ret;

  DEBUGASSERT(priv && ed && buffer && buflen > 0);

  /* We must have exclusive access to the endpoint, the TD pool, the I/O
   * buffer pool, the bulk and interrupt lists, and the HCCA interrupt
   * table.
   */

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  /* Allocate a structure to retain the information needed when the transfer
   * completes.
   */

  DEBUGASSERT(ed->xfrinfo == NULL);

  xfrinfo = lpc17_40_alloc_xfrinfo();
  if (xfrinfo == NULL)
    {
      uerr("ERROR: lpc17_40_alloc_xfrinfo failed\n");
      nbytes = -ENOMEM;
      goto errout_with_lock;
    }

  /* Initialize the transfer structure */

  memset(xfrinfo, 0, sizeof(struct lpc17_40_xfrinfo_s));
  xfrinfo->buffer = buffer;
  xfrinfo->buflen = buflen;

  ed->xfrinfo = xfrinfo;

#if LPC17_40_IOBUFFERS > 0
  /* Allocate an IO buffer if the user buffer does not lie in AHB SRAM */

  ret = lpc17_40_dma_alloc(priv, ed, buffer, buflen, &alloc);
  if (ret < 0)
    {
      uerr("ERROR: lpc17_40_dma_alloc failed: %d\n", ret);
      nbytes = (ssize_t)ret;
      goto errout_with_xfrinfo;
    }

  /* If a buffer was allocated, then use it instead of the callers buffer */

  if (alloc)
    {
      userbuffer = buffer;
      buffer  = alloc;
    }
#endif

  /* Set the request for the Writeback Done Head event well BEFORE enabling
   * the transfer.
   */

  ret = lpc17_40_wdhwait(priv, ed);
  if (ret < 0)
    {
      uerr("ERROR: Device disconnected\n");
      nbytes = (ssize_t)ret;
      goto errout_with_buffers;
    }

  /* Set up the transfer */

  ret = lpc17_40_transfer_common(priv, ed, buffer, buflen);
  if (ret < 0)
    {
      uerr("ERROR: lpc17_40_transfer_common failed: %d\n", ret);
      nbytes = (ssize_t)ret;
      goto errout_with_wdhwait;
    }

  /* Wait for the Writeback Done Head interrupt */

  ret = nxsem_wait_uninterruptible(&ed->wdhsem);
  if (ret < 0)
    {
      return ret;
    }

  /* Check the TD completion status bits */

  if (xfrinfo->tdstatus == TD_CC_NOERROR)
    {
      /* Return the number of bytes successfully transferred */

      nbytes = xfrinfo->xfrd;
      DEBUGASSERT(nbytes >= 0 && nbytes <= buflen);
    }
  else
    {
      /* Map the bad completion status to something that a class driver
       * might understand.
       */

      uerr("ERROR: Bad TD completion status: %d\n", xfrinfo->tdstatus);

      switch (xfrinfo->tdstatus)
        {
        case TD_CC_STALL:
          nbytes = -EPERM;
          break;

        case TD_CC_USER:
          nbytes = -ESHUTDOWN;
          break;

        default:
          nbytes = -EIO;
          break;
        }
     }

errout_with_wdhwait:

  /* Make sure that there is no outstanding request on this endpoint */

  xfrinfo->wdhwait = false;

errout_with_buffers:
#if LPC17_40_IOBUFFERS > 0
  /* Free any temporary IO buffers */

  lpc17_40_dma_free(priv, ed, userbuffer, buflen, alloc);
#endif

errout_with_xfrinfo:

  /* Make sure that there is no outstanding request on this endpoint */

  lpc17_40_free_xfrinfo(xfrinfo);
  ed->xfrinfo = NULL;

errout_with_lock:
  nxmutex_unlock(&priv->lock);
  return nbytes;
}

/****************************************************************************
 * Name: lpc17_40_asynch_completion
 *
 * Description:
 *   This function is called at the interrupt level when an asynchronous
 *   transfer completes.  It performs the pending callback.
 *
 * Input Parameters:
 *   priv - Internal driver state structure.
 *   ep - The IN or OUT endpoint descriptor for the device endpoint on
 *     which the transfer was performed.
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   - Called from the interrupt level
 *
 ****************************************************************************/

#ifdef CONFIG_USBHOST_ASYNCH
static void lpc17_40_asynch_completion(struct lpc17_40_usbhost_s *priv,
                                       struct lpc17_40_ed_s *ed)
{
  struct lpc17_40_xfrinfo_s *xfrinfo;
  usbhost_asynch_t callback;
  void *arg;
  ssize_t nbytes;

  DEBUGASSERT(ed != NULL && ed->xfrinfo != NULL);
  xfrinfo = ed->xfrinfo;

  DEBUGASSERT(xfrinfo->wdhwait == false &&  xfrinfo->callback != NULL &&
              xfrinfo->buffer != NULL && xfrinfo->buflen > 0);

  /* Check the TD completion status bits */

  if (xfrinfo->tdstatus == TD_CC_NOERROR)
    {
      /* Provide the number of bytes successfully transferred */

      nbytes = xfrinfo->xfrd;
    }
  else
    {
      /* Map the bad completion status to something that a class driver
       * might understand.
       */

      uerr("ERROR: Bad TD completion status: %d\n", xfrinfo->tdstatus);

      switch (xfrinfo->tdstatus)
        {
        case TD_CC_STALL:
          nbytes = -EPERM;
          break;

        case TD_CC_USER:
          nbytes = -ESHUTDOWN;
          break;

        default:
          nbytes = -EIO;
          break;
        }
     }

#if LPC17_40_IOBUFFERS > 0
  /* Free any temporary IO buffers */

  lpc17_40_dma_free(priv, ed, xfrinfo->buffer, xfrinfo->buflen,
                    xfrinfo->alloc);
#endif

  /* Extract the callback information before freeing the buffer */

  callback = xfrinfo->callback;
  arg = xfrinfo->arg;

  /* Make sure that there is no outstanding request on this endpoint */

  lpc17_40_free_xfrinfo(xfrinfo);
  ed->xfrinfo  = NULL;

  /* Then perform the callback */

  callback(arg, nbytes);
}
#endif

/****************************************************************************
 * Name: lpc17_40_asynch
 *
 * Description:
 *   Process a request to handle a transfer descriptor.  This method will
 *   enqueue the transfer request and return immediately.  When the transfer
 *   completes, the callback will be invoked with the provided transfer.
 *   This method is useful for receiving interrupt transfers which may come
 *   infrequently.
 *
 *   Only one transfer may be queued; Neither this method nor the ctrlin or
 *   ctrlout methods can be called again until the transfer completes.
 *
 * Input Parameters:
 *   drvr - The USB host driver instance obtained as a parameter from the
 *     call to the class create() method.
 *   ep - The IN or OUT endpoint descriptor for the device endpoint on which
 *     to perform the transfer.
 *   buffer - A buffer containing the data to be sent (OUT endpoint) or
 *     received (IN endpoint).  buffer must have been allocated using
 *     DRVR_ALLOC
 *   buflen - The length of the data to be sent or received.
 *   callback - This function will be called when the transfer completes.
 *   arg - The arbitrary parameter that will be passed to the callback
 *     function when the transfer completes.
 *
 * Returned Value:
 *   On success, zero (OK) is returned. On a failure, a negated errno value
 *   is returned indicating the nature of the failure.
 *
 * Assumptions:
 *   - Called from a single thread so no mutual exclusion is required.
 *   - Never called from an interrupt handler.
 *
 ****************************************************************************/

