apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_usbhost.c
#ifdef CONFIG_USBHOST_ASYNCH
static int lpc17_40_asynch(struct usbhost_driver_s *drvr, usbhost_ep_t ep,
                           uint8_t *buffer, size_t buflen,
                           usbhost_asynch_t callback, void *arg)
{
  struct lpc17_40_usbhost_s *priv = (struct lpc17_40_usbhost_s *)drvr;
  struct lpc17_40_ed_s *ed = (struct lpc17_40_ed_s *)ep;
  struct lpc17_40_xfrinfo_s *xfrinfo;
  int ret;

  DEBUGASSERT(priv && ed && ed->xfrinfo == NULL && buffer && buflen > 0 &&
              callback);

  /* We must have exclusive access to the endpoint, the TD pool, the I/O
   * buffer pool, the bulk and interrupt lists, and the HCCA interrupt table.
   */

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  /* Allocate a structure to retain the information needed when the
   * asynchronous transfer completes.
   */

  DEBUGASSERT(ed->xfrinfo == NULL);

  xfrinfo = lpc17_40_alloc_xfrinfo();
  if (xfrinfo == NULL)
    {
      uerr("ERROR: lpc17_40_alloc_xfrinfo failed\n");
      ret = -ENOMEM;
      goto errout_with_lock;
    }

  /* Initialize the transfer structure */

  memset(xfrinfo, 0, sizeof(struct lpc17_40_xfrinfo_s));
  xfrinfo->buffer   = buffer;
  xfrinfo->buflen   = buflen;
  xfrinfo->callback = callback;
  xfrinfo->arg      = arg;

  ed->xfrinfo       = xfrinfo;

#if LPC17_40_IOBUFFERS > 0
  /* Allocate an IO buffer if the user buffer does not lie in AHB SRAM */

  ret = lpc17_40_dma_alloc(priv, ed, buffer, buflen, &xfrinfo->alloc);
  if (ret < 0)
    {
      uerr("ERROR: lpc17_40_dma_alloc failed: %d\n", ret);
      goto errout_with_lock;
    }

  /* If a buffer was allocated, then use it instead of the callers buffer */

  if (xfrinfo->alloc)
    {
      buffer  = xfrinfo->alloc;
    }
#endif

  /* Set up the transfer */

  ret = lpc17_40_transfer_common(priv, ed, buffer, buflen);
  if (ret < 0)
    {
      uerr("ERROR: lpc17_40_transfer_common failed: %d\n", ret);
      goto errout_with_asynch;
    }

  /* And return now.  The callback will be invoked when the transfer
   * completes.
   */

  nxmutex_unlock(&priv->lock);
  return OK;

errout_with_asynch:
#if LPC17_40_IOBUFFERS > 0
  /* Free any temporary IO buffers */

  lpc17_40_dma_free(priv, ed, buffer, buflen, xfrinfo->alloc);
#endif

  /* Free the transfer structure */

  lpc17_40_free_xfrinfo(xfrinfo);
  ed->xfrinfo = NULL;

errout_with_lock:
  nxmutex_unlock(&priv->lock);
  return ret;
}
#endif /* CONFIG_USBHOST_ASYNCH */

/****************************************************************************
 * Name: lpc17_40_cancel
 *
 * Description:
 *   Cancel a pending transfer on an endpoint.  Cancelled synchronous or
 *   asynchronous transfer will complete normally with the error -ESHUTDOWN.
 *
 * Input Parameters:
 *   drvr - The USB host driver instance obtained as a parameter from the
 *     call to the class create() method.
 *   ep - The IN or OUT endpoint descriptor for the device endpoint on
 *     which an asynchronous transfer should be transferred.
 *
 * Returned Value:
 *   On success, zero (OK) is returned. On a failure, a negated errno value
 *   is returned indicating the nature of the failure.
 *
 ****************************************************************************/

static int lpc17_40_cancel(struct usbhost_driver_s *drvr,
                           usbhost_ep_t ep)
{
#ifdef CONFIG_USBHOST_ASYNCH
  struct lpc17_40_usbhost_s *priv = (struct lpc17_40_usbhost_s *)drvr;
#endif
  struct lpc17_40_ed_s *ed = (struct lpc17_40_ed_s *)ep;
  struct lpc17_40_gtd_s *td;
  struct lpc17_40_gtd_s *next;
  struct lpc17_40_xfrinfo_s *xfrinfo;
  uint32_t ctrl;
  irqstate_t flags;

  DEBUGASSERT(drvr != NULL && ed != NULL);

  /* These first steps must be atomic as possible */

  flags = enter_critical_section();

  /* It is possible there there is no transfer to be in progress */

  xfrinfo = ed->xfrinfo;
  if (xfrinfo)
    {
      /* It might be possible for no transfer to be in progress (callback ==
       * NULL and wdhwait == false)
       */

#ifdef CONFIG_USBHOST_ASYNCH
      if (xfrinfo->callback || xfrinfo->wdhwait)
#else
      if (xfrinfo->wdhwait)
#endif
        {
          /* Control endpoints should not come through this path and
           * isochronous endpoints are not yet implemented.  So we only have
           * to distinguish bulk and interrupt endpoints.
           */

          if (ed->xfrtype == USB_EP_ATTR_XFER_BULK)
            {
              /* Disable bulk list processing while we modify the list */

              ctrl  = lpc17_40_getreg(LPC17_40_USBHOST_CTRL);
              lpc17_40_putreg(ctrl & ~OHCI_CTRL_BLE, LPC17_40_USBHOST_CTRL);

              /* Remove the TDs attached to the ED, keeping the ED in the
               * list
               */

              td           = (struct lpc17_40_gtd_s *)
                             (ed->hw.headp & ED_HEADP_ADDR_MASK);
              ed->hw.headp = LPC17_40_TDTAIL_ADDR;
              ed->xfrinfo  = NULL;

              /* Re-enable bulk list processing, if it was enabled before */

              lpc17_40_putreg(0, LPC17_40_USBHOST_BULKED);
              lpc17_40_putreg(ctrl, LPC17_40_USBHOST_CTRL);
            }
          else
            {
              /* Remove the TDs attached to the ED, keeping the Ed in the
               * list.
               */

              td           = (struct lpc17_40_gtd_s *)
                             (ed->hw.headp & ED_HEADP_ADDR_MASK);
              ed->hw.headp = LPC17_40_TDTAIL_ADDR;
              ed->xfrinfo  = NULL;
            }

          /* Free all transfer descriptors that were connected to the ED.  In
           * some race conditions with the hardware, this might be none.
           */

          while (td != (struct lpc17_40_gtd_s *)LPC17_40_TDTAIL_ADDR)
            {
              next = (struct lpc17_40_gtd_s *)td->hw.nexttd;
              lpc17_40_tdfree(td);
              td = next;
            }

          xfrinfo->tdstatus = TD_CC_USER;

          /* If there is a thread waiting for the transfer to complete, then
           * wake up the thread.
           */

