apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_usbhost.c
  DEBUGASSERT(controller == 0);
  DEBUGASSERT(sizeof(struct lpc17_40_ed_s)  <= LPC17_40_ED_SIZE);
  DEBUGASSERT(sizeof(struct lpc17_40_gtd_s) <= LPC17_40_TD_SIZE);

  /* Initialize the state data structure */

  /* Initialize the device operations */

  drvr                 = &priv->drvr;
  drvr->ep0configure   = lpc17_40_ep0configure;
  drvr->epalloc        = lpc17_40_epalloc;
  drvr->epfree         = lpc17_40_epfree;
  drvr->alloc          = lpc17_40_alloc;
  drvr->free           = lpc17_40_free;
  drvr->ioalloc        = lpc17_40_ioalloc;
  drvr->iofree         = lpc17_40_iofree;
  drvr->ctrlin         = lpc17_40_ctrlin;
  drvr->ctrlout        = lpc17_40_ctrlout;
  drvr->transfer       = lpc17_40_transfer;
#ifdef CONFIG_USBHOST_ASYNCH
  drvr->asynch         = lpc17_40_asynch;
#endif
  drvr->cancel         = lpc17_40_cancel;
#ifdef CONFIG_USBHOST_HUB
  drvr->connect        = lpc17_40_connect;
#endif
  drvr->disconnect     = lpc17_40_disconnect;

  /* Initialize the public port representation */

  hport                = &priv->rhport.hport;
  hport->drvr          = drvr;
#ifdef CONFIG_USBHOST_HUB
  hport->parent        = NULL;
#endif
  hport->ep0           = EDCTRL;
  hport->speed         = USB_SPEED_FULL;
  hport->funcaddr      = 0;

  /* Initialize function address generation logic */

  usbhost_devaddr_initialize(&priv->devgen);
  priv->rhport.pdevgen = &priv->devgen;

#ifndef CONFIG_USBHOST_INT_DISABLE
  priv->ininterval  = MAX_PERINTERVAL;
  priv->outinterval = MAX_PERINTERVAL;
#endif

  /* Enable power by setting PCUSB in the PCONP register.  Disable
   * interrupts because this register may be shared with other drivers.
   */

  flags   = enter_critical_section();
  regval  = lpc17_40_getreg(LPC17_40_SYSCON_PCONP);
  regval |= SYSCON_PCONP_PCUSB;
  lpc17_40_putreg(regval, LPC17_40_SYSCON_PCONP);
  leave_critical_section(flags);

  /* Enable clocking on USB (USB PLL clocking was initialized in very
   * low-level clock setup logic (see lpc17_40_clockconfig.c)).  We do still
   * need* to set up USBOTG CLKCTRL to enable clocking.
   *
   * NOTE: The PORTSEL clock needs to be enabled only when accessing
   * OTGSTCTRL
   */

  lpc17_40_putreg(LPC17_40_CLKCTRL_ENABLES, LPC17_40_USBOTG_CLKCTRL);

  /* Then wait for the clocks to be reported as "ON" */

  do
    {
      regval = lpc17_40_getreg(LPC17_40_USBOTG_CLKST);
    }
  while ((regval & LPC17_40_CLKCTRL_ENABLES) != LPC17_40_CLKCTRL_ENABLES);

  /* Set the OTG status and control register.  Bits 0:1 apparently mean:
   *
   *   00: U1=device, U2=host
   *   01: U1=host, U2=host
   *   10: reserved
   *   11: U1=host, U2=device
   *
   * We need only select U1=host (Bit 0=1, Bit 1 is not used on LPC176x);
   * NOTE: The PORTSEL clock needs to be enabled when accessing OTGSTCTRL
   */

  lpc17_40_putreg(1, LPC17_40_USBOTG_STCTRL);

  /* Now we can turn off the PORTSEL clock */

  lpc17_40_putreg((LPC17_40_CLKCTRL_ENABLES & ~USBOTG_CLK_PORTSELCLK),
                  LPC17_40_USBOTG_CLKCTRL);

  /* Configure I/O pins */

  usbhost_dumpgpio();
  lpc17_40_configgpio(GPIO_USB_DP);      /* Positive differential data */
  lpc17_40_configgpio(GPIO_USB_DM);      /* Negative differential data */
  lpc17_40_configgpio(GPIO_USB_UPLED);   /* GoodLink LED control signal */
  lpc17_40_configgpio(GPIO_USB_PPWR);    /* Port Power enable signal for USB port */
  lpc17_40_configgpio(GPIO_USB_PWRD);    /* Power Status for USB port (host power switch) */
  lpc17_40_configgpio(GPIO_USB_OVRCR);   /* USB port Over-Current status */
  usbhost_dumpgpio();

  uinfo("Initializing Host Stack\n");

  /* Show AHB SRAM memory map */

#if 0 /* Useful if you have doubts about the layout */
  uinfo("AHB SRAM:\n");
  uinfo("  HCCA:   %08x %d\n",
        LPC17_40_HCCA_BASE,   LPC17_40_HCCA_SIZE);
  uinfo("  TDTAIL: %08x %d\n",
        LPC17_40_TDTAIL_ADDR, LPC17_40_TD_SIZE);
  uinfo("  EDCTRL: %08x %d\n",
        LPC17_40_EDCTRL_ADDR, LPC17_40_ED_SIZE);
  uinfo("  EDFREE: %08x %d\n",
        LPC17_40_EDFREE_BASE, LPC17_40_ED_SIZE);
  uinfo("  TDFREE: %08x %d\n",
        LPC17_40_TDFREE_BASE, LPC17_40_EDFREE_SIZE);
  uinfo("  TBFREE: %08x %d\n",
        LPC17_40_TBFREE_BASE, LPC17_40_TBFREE_SIZE);
  uinfo("  IOFREE: %08x %d\n",
        LPC17_40_IOFREE_BASE,
        LPC17_40_IOBUFFERS * CONFIG_LPC17_40_USBHOST_IOBUFSIZE);
#endif

  /* Initialize all the TDs, EDs and HCCA to 0 */

  memset((void *)HCCA,   0, sizeof(struct ohci_hcca_s));
  memset((void *)TDTAIL, 0, sizeof(struct ohci_gtd_s));
  memset((void *)EDCTRL, 0, sizeof(struct lpc17_40_ed_s));

  nxsem_init(&EDCTRL->wdhsem, 0, 0);

  /* Initialize user-configurable EDs */

  buffer = (uint8_t *)LPC17_40_EDFREE_BASE;
  for (i = 0; i < CONFIG_LP17_USBHOST_NEDS; i++)
    {
      /* Put the ED in a free list */

      lpc17_40_edfree((struct lpc17_40_ed_s *)buffer);
      buffer += LPC17_40_ED_SIZE;
    }

  /* Initialize user-configurable TDs */

  buffer = (uint8_t *)LPC17_40_TDFREE_BASE;
  for (i = 0; i < CONFIG_LP17_USBHOST_NTDS; i++)
    {
      /* Put the TD in a free list */

      lpc17_40_tdfree((struct lpc17_40_gtd_s *)buffer);
      buffer += LPC17_40_TD_SIZE;
    }

  /* Initialize user-configurable request/descriptor transfer buffers */

  buffer = (uint8_t *)LPC17_40_TBFREE_BASE;
  for (i = 0; i < CONFIG_LPC17_40_USBHOST_TDBUFFERS; i++)
    {
      /* Put the TD buffer in a free list */

      lpc17_40_tbfree(buffer);
      buffer += CONFIG_LPC17_40_USBHOST_TDBUFSIZE;
    }

#if LPC17_40_IOBUFFERS > 0
  /* Initialize user-configurable IO buffers */

  buffer = (uint8_t *)LPC17_40_IOFREE_BASE;
  for (i = 0; i < LPC17_40_IOBUFFERS; i++)
    {
      /* Put the IO buffer in a free list */

      lpc17_40_freeio(buffer);
      buffer += CONFIG_LPC17_40_USBHOST_IOBUFSIZE;
    }
#endif

  /* Initialize transfer structures */

  for (i = 0, xfrinfo = g_xfrbuffers;
       i < CONFIG_LPC17_40_USBHOST_NPREALLOC;
       i++, xfrinfo++)
    {
      /* Put the transfer structure in a free list */

      lpc17_40_free_xfrinfo(xfrinfo);
    }

