apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_usbhost.c
  /* Wait 50MS then perform hardware reset */

  up_mdelay(50);

  lpc17_40_putreg(0, LPC17_40_USBHOST_CTRL);        /* Hardware reset */
  lpc17_40_putreg(0, LPC17_40_USBHOST_CTRLHEADED);  /* Initialize control list head to Zero */
  lpc17_40_putreg(0, LPC17_40_USBHOST_BULKHEADED);  /* Initialize bulk list head to Zero */

  /* Software reset */

  lpc17_40_putreg(OHCI_CMDST_HCR, LPC17_40_USBHOST_CMDST);

  /* Write Fm interval (FI), largest data packet counter (FSMPS), and
   * periodic start.
   */

  lpc17_40_putreg(DEFAULT_FMINTERVAL, LPC17_40_USBHOST_FMINT);
  lpc17_40_putreg(DEFAULT_PERSTART, LPC17_40_USBHOST_PERSTART);

  /* Put HC in operational state */

  regval  = lpc17_40_getreg(LPC17_40_USBHOST_CTRL);
  regval &= ~OHCI_CTRL_HCFS_MASK;
  regval |= OHCI_CTRL_HCFS_OPER;
  lpc17_40_putreg(regval, LPC17_40_USBHOST_CTRL);

  /* Set global power in HcRhStatus */

  lpc17_40_putreg(OHCI_RHSTATUS_SGP, LPC17_40_USBHOST_RHSTATUS);

  /* Set HCCA base address */

  lpc17_40_putreg((uint32_t)HCCA, LPC17_40_USBHOST_HCCA);

  /* Set up the root hub port EP0 */

  lpc17_40_ep0init(priv);

  /* Clear pending interrupts */

  regval = lpc17_40_getreg(LPC17_40_USBHOST_INTST);
  lpc17_40_putreg(regval, LPC17_40_USBHOST_INTST);

  /* Enable OHCI interrupts */

  lpc17_40_putreg(LPC17_40_ALL_INTS | OHCI_INT_MIE, LPC17_40_USBHOST_INTEN);

  /* Attach USB host controller interrupt handler */

  if (irq_attach(LPC17_40_IRQ_USB, lpc17_40_usbinterrupt, NULL) != 0)
    {
      uerr("ERROR: Failed to attach IRQ\n");
      return NULL;
    }

  /* Enable USB interrupts at the SYCON controller.  Disable interrupts
   * because this register may be shared with other drivers.
   */

  flags   = enter_critical_section();
  regval  = lpc17_40_getreg(LPC17_40_SYSCON_USBINTST);
  regval |= SYSCON_USBINTST_ENINTS;
  lpc17_40_putreg(regval, LPC17_40_SYSCON_USBINTST);
  leave_critical_section(flags);

  /* If there is a USB device in the slot at power up, then we will not
   * get the status change interrupt to signal us that the device is
   * connected.  We need to set the initial connected state accordingly.
   */

  regval          = lpc17_40_getreg(LPC17_40_USBHOST_RHPORTST1);
  priv->connected = ((regval & OHCI_RHPORTST_CCS) != 0);

  /* Enable interrupts at the interrupt controller */

  up_enable_irq(LPC17_40_IRQ_USB); /* enable USB interrupt */
  uinfo("USB host Initialized, Device connected:%s\n",
        priv->connected ? "YES" : "NO");

  return &g_usbconn;
}
